docs/build/prova_ingles.tex
% Created 2023-05-03 qua 14:29
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{todonotes}
\usepackage[brazil, portuges]{babel}
\usepackage{amsthm}
\author{Ieremies Vieira da Fonseca Romero (RA 217938)}
\date{\today}
\title{Prova de Inglês\\\medskip
\large Pós-graduação 2023}
\hypersetup{
 pdfauthor={Ieremies Vieira da Fonseca Romero (RA 217938)},
 pdftitle={Prova de Inglês},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6.1)}, 
 pdflang={Portuges}}
\usepackage[date=year]{biblatex}
\addbibresource{~/arq/bib.bib}
\begin{document}

\maketitle

\section*{Question 1}
\label{sec:orge8472e4}
\begin{enumerate}
\item A dificuldade de ingressantes no mercado da computação advindas de condições socioeconômicas e, principalmente, de terem frequentado universidades menos renomeadas. Dificuldades financeiras atreladas, reduzindo o tempo que pode ser dedicados a projetos paralelos, com a falta de valorização das empresas de tecnologia em relação a universidades menores, faz com que muitos não consigam se inserir no mercado.
\item O autor do texto cita a falta de reconhecimento de universidades mais acessíveis por parte do mercado; a condição socioeconômica dos alunos destas universidades não permitem que se dediquem a projetos paralelos, seus portfólios e hackatons, o que os coloca em desvantagem; grandes empresas do mercado tendem a dar preferências a candidatos com algum tipo de relacionamento com atuais empregados ou os próprios estagiários, mas já que muitos destes vêm das renomadas universidades, tais alunos que o texto trata sofrem ainda mais dificuldades.
\item O autor contribui positivamente ao assunto discutido trazendo-o a tona. Detalhes de recrutamento de empresas muitas vezes podem ficar escondidos ou isolados, sem que tenhamos uma perspectiva de mercado como um todo. Ele mostra como não são fatos isolados e muitas são as experiências frustrantes e injustas daqueles que tentam entrar no mercado de tecnologia, ajudando a tomarmos, como sociedade, consciência do problema.
\end{enumerate}
\section*{Question 2}
\label{sec:orga5f9256}
Highly coveted internships at top tech companies, like Amazon and Google, can provide lifelong benefits, including the potential for full-time job openings and substantial pay. However, the typical recruitment process often gives an advantage to students from top IT schools and those with industry connections, and may have more time and opportunities to polish their portfolios and hone their testing skills. Most students spent hours applying for a huge number of internships, practicing for coding tests or working on personal projects to try to impress recruiters, all while having to work part-time, only to receive no offers. Students at lesser-known schools often lack industry, family, or elite university connections that lead to employee referrals. The intern selection process highlights long-standing inequalities in recruiting and hiring at tech companies, which have been exacerbated by the recent layoffs and cuts. Although some companies have some kind of inclusivity programs, those tend to just alleviate the problem rather than trying to systematically solve it.
\end{document}